backend/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 200

scenarios:
  - name: "Send Events Load Test"
    flow:
      - post:
          url: "/events/send"
          json:
            type: "load_test_event"
            payload:
              userId: "user_{{ $randomString() }}"
              action: "test_action"
              timestamp: "{{ $timestamp() }}"
              testData: "Load test data {{ $randomInt(1, 1000) }}"