backend/load-test.yml
config:
  target: "http://localhost:3000"
  phases:

    # 🔴 Sustained peak (THIS is where you measure throughput)
    - duration: 60
      arrivalRate: 300
      name: "Sustained load"

  defaults:
    headers:
      Content-Type: "application/json"

  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: "Async throughput test"
    flow:
      - get:
          url: "/async-wait"