backend/load-test.yml
config:
  target: "http://loadtest-327483427.us-east-1.elb.amazonaws.com"
  http:
    pool: 1000   # reuse up to 1000 connections
    keepAlive: true
  phases:
    - duration: 600
      arrivalRate: 5  # 5 requests per second

scenarios:
  - name: stress-cpu
    flow:
      - get:
          url: "/stress-cpu"