backend/load-test.yml
config:
  target: "http://localhost:3000"

  phases:
    - duration: 60
      arrivalRate: 100
      name: "Warm up"
    - duration: 60
      arrivalRate: 500
      name: "Medium load"
    - duration: 60
      arrivalRate: 1000
      name: "Heavy load"

  defaults:
    headers:
      Content-Type: "application/json"

  http:
    timeout: 30
    pool: 100
    maxSockets: 200

scenarios:
  - name: "Mixed DB Load"
    weight: 3
    flow:
      - get:
          url: "/db-read"

  - name: "Write Load"
    weight: 1
    flow:
      - post:
          url: "/db-write"