backend/load-test.yml
config:
  target: "http://loadtest-327483427.us-east-1.elb.amazonaws.com"
  http:
    pool: 1000   # reuse up to 1000 connections
    keepAlive: true
  phases:
    - duration: 60
      arrivalRate: 50
    - duration: 60
      arrivalRate: 100
    - duration: 60
      arrivalRate: 200

scenarios:
  - name: compute
    flow:
      - get:
          url: "/stress-cpu"