backend/load-test.yml
config:
  target: "http://localhost:3000"
  pool:

  phases:
    - duration: 60
      arrivalRate: 100
    - duration: 60
      arrivalRate: 500
    - duration: 60
      arrivalRate: 1000

  defaults:
    headers:
      Content-Type: "application/json"

  plugins:
    metrics-by-endpoint: {}

  # Connection settings to prevent EADDRINUSE
  http:
    timeout: 30
    pool: 50 # Reuse connections
    maxSockets: 100

scenarios:
  - name: "Async throughput test"
    flow:
      - get:
          url: "/async-wait"