backend/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase: moderate load
    - duration: 120      # 2 minutes
      arrivalRate: 100   # 100 requests per second
      rampTo: 200        # gradually increase to 200 RPS

    # Spike phase: high load
    - duration: 180      # 3 minutes
      arrivalRate: 200
      rampTo: 500        # gradually increase to 500 RPS

    # Cooldown phase: back to moderate load
    - duration: 120      # 2 minutes
      arrivalRate: 500
      rampTo: 100        # gradually decrease

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: async-wait
    flow:
      - get:
          url: "/async-wait"