backend/load-test.yml
config:
  target: "http://loadtest-balancer-619162860.us-east-1.elb.amazonaws.com"  # your API URL
  phases:
    - duration: 10  # run for 600 seconds (10 minutes)
      arrivalRate: 1  # 5 requests per second

scenarios:
  - name: "Push CPU jobs to SQS"
    flow:
      - get:
          url: "/stress-cpu"